const G: Record<string, [string, number, number][]> = {
  'ঢাকা বিভাগ': [
    ['ঢাকা', 23.81, 90.41], ['গাজীপুর', 24.0, 90.42], ['নারায়ণগঞ্জ', 23.62, 90.5],
    ['মুন্সিগঞ্জ', 23.55, 90.53], ['নরসিংদী', 23.92, 90.72], ['মানিকগঞ্জ', 23.86, 90.0],
    ['টাঙ্গাইল', 24.25, 89.92], ['কিশোরগঞ্জ', 24.43, 90.78], ['ফরিদপুর', 23.6, 89.84],
    ['গোপালগঞ্জ', 23.0, 89.83], ['মাদারীপুর', 23.17, 90.2], ['রাজবাড়ী', 23.76, 89.64],
    ['শরীয়তপুর', 23.22, 90.35],
  ],
  'চট্টগ্রাম বিভাগ': [
    ['চট্টগ্রাম', 22.34, 91.83], ['কক্সবাজার', 21.43, 91.98], ['কুমিল্লা', 23.46, 91.18],
    ['ব্রাহ্মণবাড়িয়া', 23.96, 91.11], ['চাঁদপুর', 23.23, 90.65], ['লক্ষ্মীপুর', 22.94, 90.84],
    ['নোয়াখালী', 22.87, 91.1], ['ফেনী', 23.02, 91.4], ['খাগড়াছড়ি', 23.12, 91.98],
    ['রাঙামাটি', 22.65, 92.17], ['বান্দরবান', 22.2, 92.22],
  ],
  'রাজশাহী বিভাগ': [
    ['রাজশাহী', 24.37, 88.6], ['বগুড়া', 24.85, 89.37], ['জয়পুরহাট', 25.1, 89.02],
    ['নওগাঁ', 24.8, 88.94], ['নাটোর', 24.41, 89.0], ['চাঁপাইনবাবগঞ্জ', 24.6, 88.28],
    ['পাবনা', 24.0, 89.23], ['সিরাজগঞ্জ', 24.45, 89.7],
  ],
  'খুলনা বিভাগ': [
    ['খুলনা', 22.82, 89.55], ['বাগেরহাট', 22.66, 89.79], ['সাতক্ষীরা', 22.72, 89.07],
    ['যশোর', 23.17, 89.21], ['নড়াইল', 23.17, 89.5], ['মাগুরা', 23.49, 89.42],
    ['ঝিনাইদহ', 23.54, 89.17], ['কুষ্টিয়া', 23.9, 89.12], ['চুয়াডাঙ্গা', 23.64, 88.85],
    ['মেহেরপুর', 23.76, 88.63],
  ],
  'বরিশাল বিভাগ': [
    ['বরিশাল', 22.7, 90.37], ['ভোলা', 22.69, 90.65], ['পটুয়াখালী', 22.36, 90.33],
    ['পিরোজপুর', 22.58, 89.97], ['ঝালকাঠি', 22.64, 90.2], ['বরগুনা', 22.15, 90.13],
  ],
  'সিলেট বিভাগ': [
    ['সিলেট', 24.9, 91.87], ['মৌলভীবাজার', 24.48, 91.77], ['হবিগঞ্জ', 24.38, 91.42],
    ['সুনামগঞ্জ', 25.07, 91.4],
  ],
  'রংপুর বিভাগ': [
    ['রংপুর', 25.75, 89.25], ['দিনাজপুর', 25.63, 88.64], ['ঠাকুরগাঁও', 26.03, 88.46],
    ['পঞ্চগড়', 26.34, 88.55], ['নীলফামারী', 25.93, 88.86], ['লালমনিরহাট', 25.99, 89.45],
    ['কুড়িগ্রাম', 25.81, 89.65], ['গাইবান্ধা', 25.33, 89.53],
  ],
  'ময়মনসিংহ বিভাগ': [
    ['ময়মনসিংহ', 24.75, 90.41], ['জামালপুর', 24.92, 89.94], ['নেত্রকোনা', 24.88, 90.73],
    ['শেরপুর', 25.02, 90.02],
  ],
}

export const DIVISIONS = Object.keys(G)

export const DISTRICTS: [string, string, number, number][] = Object.entries(G).flatMap(
  ([d, arr]) => arr.map(([n, la, ln]) => [d, n, la, ln] as [string, string, number, number])
)
